import 'package:socionic_tools/models/relation.dart';

const Relation dualRelation = Relation(
    name: "Дуальные",
    longName: "Дуальные отношения",
    moto: "Всегда дополнят",
    rating: 5,
    desc:
        "Это самые легендарные в соционике отношения. Чего только замечательного не было сказано в их адрес! Но на самом деле дуальные отношения могут успешно развиваться далеко не всегда. Конечно, в них заложена способность адекватно, с соответствующим тактом и вовремя отреагировать на слова, предложения, просьбы партнера. И они достаточно благоприятны для сотрудничества, помощи в затруднительных ситуациях, хорошего отдыха. Но все это работает только тогда, когда каждый из партнеров уже решил свои проблемы социальной адаптации и имеет устойчивую положительную самооценку. В противном случае это очень болезненное взаимодействие, полное взаимных претензий и обид. Партнеры очень разные люди, но способны не задевать больные места, если относятся друг к другу достаточно бережно. В идеале такие отношения призваны решить наши проблемы доверия и полноты жизни.");
const Relation activationRelation = Relation(
    name: "Активация",
    longName: "Отношения активации",
    moto: "Хорошо отдыхается",
    rating: 4,
    desc:
        "Эти отношения тоже протекают спокойно, только если партнеры не впадают в стрессовое состояние. В этих отношениях можно зарядиться, поддержать друг друга, снять плохое настрое ние, поддержать в нестандартных проявлениях. Но если жизнь людей устроена так, что в ней присутствует напряжение, то возможны столкновение интересов, недопонимание и травмирующие другого выходки. Тогда оправдывается присказка: «активатор страшнее, чем аллигатор». Несколько юмористический настрой, ирония - характерная черта этих отношений. Они призваны помочь нам признать наличие внутренних, обычно вытесняемых проблем.");
const Relation businessRelation = Relation(
    name: "Деловые",
    longName: "Деловые отношения",
    moto: "Надежные товарищи ",
    rating: 4,
    desc:
        "деловые партнеры часто понимают и потому не опасаются друг друга. Для таких отношений характерны общее творчество, адекватное восприятие информации и споры. К тому же партнер снимает подростковую неуверенность в социальной адаптации. Такие отношения хороши, когда человек хочет совершить какой-то творческий прорыв, и ему нужна поддержка единомышленника. Типы в этих отношениях достаточно различны внутренне, поэтому они могут быть интересны друг другу.");
const Relation conflictRelation = Relation(
    name: "Конфликтные",
    longName: "Конфликтные отношения",
    moto: "Возможны конфликты",
    rating: 1,
    desc:
        "Это настоящее пугало соционического мира. «Ах, он мой конфликтер, надо держаться от него подальше!» — вот знакомая реакция, взращенная на «страшных сказках». Конечно, информационный конфликт - это трудные в смысле взаимопонимания отношения. Люди просто не видят того, что составляет существенные моменты в жизни другого. Зато наша несостоятельность не укроется от нашего конфликтера никогда. И не надо забывать, по отношения эти симметричны, и вы мучаете его так же. Поэтому совместная работа на близкой дистанции таким людям не рекомендуется. Однако, избегая конфликтных партнеров, мы теряем достаточно много. Дело в том, что в тех ситуациях, когда мы полностью дезориентированы и не знаем, куда двигаться дальше, именно наш конфликтер разбирается вполне экспертно. И именно он призван вывести нас из тупика, когда проблема выбора затмевает для нас всю окружающую реальность.");
const Relation controlRelation = Relation(
    name: "Контролер",
    longName: "Отношения социальной ревизии",
    moto: "Покровительствует",
    rating: 1,
    desc:
        "Если подконтрольный видит контролера уверенным в себе и неоправданно критичным, то контролеру он, наоборот, видится хрупким, неустойчивым, неприспособленным. Выяснение отношений между ними легко может разрушить взаимодействие. Контролер часто требует от подконтрольного того, в чем он слаб, поэтому контролера обычно побаиваются. Партнеры поставлены в неравное положение, один партнер «Вооружен» сильнее, чем другой, хотя и негативные оценки разъяренного подконтрольного способны надолго разрушить душевный покой контролера.\n    Эти отношения тоже обросли множеством легенд, но уже негативного свойства. И здесь тотальный негатив тоже не отражает действительности. Многолетние устойчивые «контрольные» браки говорят о том, что в таких отношениях существует конструктивный режим сосуществования. Анализ показывает, что для согласия подконтрольный должен быть лично заинтересован в этих отношениях, а контролер - отказаться от жестких оценок партнера. Тогда отношения контроля обоим партнерам помогают разобраться с проблемами долга: контролер учится взыскивать должное, а подконтрольный - отдавать его.");
const Relation customerRelation = Relation(
    name: "Заказчик",
    longName: "Отношения социального заказа",
    moto: "Любит учить жизни",
    rating: 2,
    desc:
        "Заказчик непроизвольно ставит подзаказного в такое положение, что Тому очень трудно отказаться или не прислушаться к высказыванию заказчика. Подзаказный заказчику при этом кажется понятным и простым. Слова заказчика подзаказный воспринимает внимательно и серьезно, они пробуждают его активность. И если подзаказный личность творческая, то он оказывается в состоянии снять самоограничения заказчика и вывести его из творческого тупика. Это хорошие продуктивные отношения, они информационно активны, дискуссии - их неотъемлемая часть. Заказчик здесь отрабатывает способность нести ответственность за принятие решений, подзаказный - ответственность за выполнение заданий.");
const Relation mirageRelation = Relation(
    name: "Миражные",
    longName: "Миражные отношения",
    moto: "Приятно отдыхается ",
    rating: 4,
    desc:
        "Название очень точно отражает содержание этих отношений. Для них характерны взаимопомощь, предупредительность, поддержка. Они хороши для совместной работы, но до тех пор, пока не включается личный интерес. Совершенно неожиданно взаимодействие, беседа может наткнуться на непонимание, игнорирование взглядов или интересов другого. Это очень неплотные отношения, но они могут создать иллюзию многих других, например дуальных или родственных. Однако, в отличие от всех прочих, миражные отношения оставляют человеку гораздо большую внутреннюю свободу. Более того, именно наш миражный партнер лучше других оценит наши подсознательные самоограничения и комплексы и сумеет снять с них устрашающий ореол. Таким образом, миражные отношения призваны вернуть нам нашу внутреннюю свободу, осознать лишние ограничения, которые мы бессознательно принимали.");
const Relation mirrorRelation = Relation(
    name: "Зеркальные",
    longName: "Зеркальные отношения",
    moto: "Конструктивная критика",
    rating: 2,
    desc:
        "в зеркальных отношениях заложена способность людей к взаимопониманию, их взаимопомощи. Хорошие отношения для работы, творчества, самореализации. Здесь всегда один из партнеров деятель, другой - критик. Творческие проявления каждого! встречают понимание и всестороннюю квалифицированную оценку. Возможно доброжелательное предупреждение об ошибках и опасностях. Однако слабости у партнеров одинаковые, и здесь они вряд ли сумеют друг другу помочь. Если люди заинтересованы в творческом росте и самовыражении, в этих отношениях они найдут хорошую поддержку.");
const Relation performerRelation = Relation(
    name: "Исполнитель",
    longName: "Отношения социального заказа",
    moto: "Завоевывает внимание",
    rating: 2,
    desc:
        "Заказчик непроизвольно ставит подзаказного в такое положение, что Тому очень трудно отказаться или не прислушаться к высказыванию заказчика. Подзаказный заказчику при этом кажется понятным и простым. Слова заказчика подзаказный воспринимает внимательно и серьезно, они пробуждают его активность. И если подзаказный личность творческая, то он оказывается в состоянии снять самоограничения заказчика и вывести его из творческого тупика. Это хорошие продуктивные отношения, они информационно активны, дискуссии - их неотъемлемая часть. Заказчик здесь отрабатывает способность нести ответственность за принятие решений, подзаказный - ответственность за выполнение заданий.");
const Relation quasiRelation = Relation(
    name: "Квазитождество",
    longName: "Отношения квазитождества",
    moto: "Частое недопонимание",
    rating: 2,
    desc:
        "Это «Клубные» отношения, т.е. сильные функции у партнеров одной природы. Они более плотные, чем предыдущие. Здесь возможны дискуссии, обмен интересной информацией, однако трудно встать на внутреннюю точку зрения партнера, понять его мотивы и цели. Попытки убедить, доказать свою правоту, объяснить что-то - характерная черта этих отношений. И при всей полезности полученных сведений они кажутся несколько неактуальными. Интересы «Квазитождиков» лежат в разных плоскостях. Но в дискуссиях с таким партнером оттачивается искусство отстаивать в общении свои жизненные принципы.");
const Relation semiDualRelation = Relation(
    name: "Полудуал",
    longName: "Полудуальные отношения",
    moto: "Тонизируют ",
    rating: 4,
    desc:
        "Во многом эти отношения похожи на отношения дополнения. Они такие же интересные, живые, вносящие в жизнь как элементы любования партнером, так и активные совместные творческие проявления, если оба партнера к этому готовы. Но информационно они более активны, им в большей степени присуще сопоставление взглядов, взаимное обучение. Однако общая природа болевых точек, которые различаются только вертностью, таит в себе опасность разрушения отношений. Когда полудуальная пара оказывается перед необходимостью решать проблемы по одной из своих болевых точек, второй партнер не может удержать ситуацию. Его слабая референтная функция при этом не может противопоставить себя негативному потоку информации. Возникающие претензии возвращаются партнеру, и отношения признаются ненужными обоим. Но пока партнеры находятся во взрослом, творческом состоянии, они очень успешно стимулируют творчество и расширяют сознание друг друга. Полудуальные отношения призваны активизировать освоение человеком новой информации, расширить его кругозор.");
const Relation superegoRelation = Relation(
    name: "Суперэго",
    longName: "Отношения суперэго",
    moto: "Взаимная симпатия",
    rating: 3,
    desc:
        "Отношения острых ощущений, могут быть тонизирующими, способствовать генерации Идей, однако не дающие полного чувства взаимопонимания. Партнеры кажутся друг другу весьма успешными в вопросах социальной адаптации. Чтобы обрести уверенность в обществе, каждый старается подражать другому. В такой паре хорошо проходит критическая оценка окружения, но практически невозможно совместное творчество. Любые практические поползновения партнера вызывают напряжение и желание уйти от контакта. Такие отношения не предназначены для совместной работы, их задача - обеспечить ориентацию среди людей.");
const Relation underControlRelation = Relation(
    name: "Подконтрольный",
    longName: "Отношения социальной ревизии",
    moto: "Подконтрольный",
    rating: 1,
    desc:
        "Если подконтрольный видит контролера уверенным в себе и неоправданно критичным, то контролеру он, наоборот, видится хрупким, неустойчивым, неприспособленным. Выяснение отношений между ними легко может разрушить взаимодействие. Контролер часто требует от подконтрольного того, в чем он слаб, поэтому контролера обычно побаиваются. Партнеры поставлены в неравное положение, один партнер «Вооружен» сильнее, чем другой, хотя и негативные оценки разъяренного подконтрольного способны надолго разрушить душевный покой контролера.\n   Эти отношения тоже обросли множеством легенд, но уже негативного свойства. И здесь тотальный негатив тоже не отражает действительности. Многолетние устойчивые «контрольные» браки говорят о том, что в таких отношениях существует конструктивный режим сосуществования. Анализ показывает, что для согласия подконтрольный должен быть лично заинтересован в этих отношениях, а контролер - отказаться от жестких оценок партнера. Тогда отношения контроля обоим партнерам помогают разобраться с проблемами долга: контролер учится взыскивать должное, а подконтрольный - отдавать его.");
const Relation oppositeRelation = Relation(
    name: "Противоположность",
    longName: "Отношения противоположности",
    moto: "Изменчивы в отношениях",
    rating: 2,
    desc:
        "Это «Клубные» отношения, им соответствуют интересный и полезный обмен мнениями, информацией, дискуссии. Работать лучше раздельно. Если партнеры работают вместе - лучше только вдвоем, третий лишний, он «уводит» одного из партнеров. Это очень неплотные отношения: в них каждый раз отрабатывается только один сюжет, да и тот легко затухает. Партнеры довольно близки по восприятию, поэтому согласие находят быстро, но так же быстро исчерпываются и темы для общения. Но такой партнер может быть источником пополнения наших стандартных программ выживания. Отношения погашения помогают партнерам научиться согласовывать свои творческие амбиции с использованием стандартных бытовых обязанностей.");
const Relation equalRelation = Relation(
    name: "Тождественные",
    longName: "Тождественные отношения",
    moto: "Всегда поймут",
    rating: 4,
    desc:
        "«Счастье - это когда тебя понимают», — сказано про эти отношения. Часто в них наблюдается полная синхронность реакций, так как отношения тождества характеризуются очень похожим восприятием информации. В них заложена способность к точному пониманию смысла слов, причин и целей поступков партнера. Отношения комфортны благодаря отсутствию неожиданностей, однако партнер слишком понятен, чтобы долго быть интересным, его преследуют те же проблемы. Партнеры в этом случае не могут квалифицированно помочь друг другу, поскольку слабые функции у них одинаковы. Такие отношения хорошо решают проблему самоидентификации и настройки на собствен ный тип.");
const Relation familyRelation = Relation(
    name: "Родственные",
    longName: "Родственные отношения",
    moto: "Любимы на расстоянии ",
    rating: 4,
    desc:
        "«Родственники» похожи, очень хорошо понимают друг друга, легко находят общий язык в оценке происходящего. Это очень плотные отношения. Партнер чувствуется во всех его проявлениях. Видны многие его хитрости и бессознательные реакции. Но при обсуждении совместных действий интересы партнеров расходятся кардинально. Пара может отстаивать свои позиции даже в самой неблагоприятной обстановке. Однако часто присутствуют взаимная критическая оценка, замечания, придирки к мелочам. Возможны действия, задевающие партнеров. Эти отношения помогают людям решить проблему поиска своего места в мире и обществе.");
