import '../models/sign.dart';

const Sign static = Sign(
    name: "Статика",
    desc: "Статики воспринимают действительность как набор статических картинок (слайдов), которые могут быть не связаны непрерывным потоком изменений."
);

const Sign dynamic = Sign(
    name: "Динамика",
    desc: "Динамики воспринимают действительность как последовательность событий."
);

const Sign positivism = Sign(
  name: "Позитивизм",
  desc: "позитивисты, оценивая ситуацию, выделяют те качества, которые в ней присутствуют. Например: “Погода хорошая, небо ясное”."
);

const Sign negativism = Sign(
    name: "Негативизм",
    desc: "Негативисты при оценке ситуации выделяют те качества, которые в ней отсутствуют. Например: “Неплохая погода, на небе - ни облачка”."
);

const Sign questim = Sign(
    name: "Квестимность",
    desc: "Квестимы в разговоре склонны к диалогу. Речь квестима «многотональная», в ней перемежаются вопросительные и утвердительные интонации. Рассказывая о чем-либо они могут задавать вопросы и сами же на них отвечать. Склонны отвечать вопросом на вопрос."
);

const Sign declatim = Sign(
    name: "Деклатимность",
    desc: "Деклатимы склонны к монологу. Их речь обычно звучит в одной тональности.Примечание. Вертность оказывает влияние на проявление признака квестимность/деклатимность. Интроверсия усиливает квестимность, экстраверсия — деклатимность."
);

const Sign tactic = Sign(
    name: "Тактика",
    desc: "Для тактика важен путь, движение, последовательность его шагов и действий, при этом цель ставится неосознанно и может корректироваться."
);

const Sign strategic = Sign(
    name: "Стратегия",
    desc: "Для стратега важна цель, желаемое состояние. При этом путь к ее достижению выбирается неосознанно и может меняться."
);

const Sign constructivism = Sign(
    name: "Конструктивизм",
    desc: "Конструктивисты получают из внешнего мира фактическую информацию. Общаясь с человеком стараются избежать «эмоциональной подстройки» под его состояние. Для того чтобы пережить какие-либо эмоции склонны возвращаться к событию или месту, где они были вызваны, например, могут по нескольку раз перечитывать одну и ту же книгу."
);

const Sign emotivism = Sign(
    name: "Эмотивизм",
    desc: "Эмотивисты стремятся получить из внешнего мира новые эмоциональные впечатления. При общении с человеком стараются ввести его в нужное эмоциональное состояние, либо самим подстроиться под состояние собеседника."
);

const Sign process = Sign(
    name: "Процесс",
    desc: "Эти люди не осознают себя отдельно от процесса, стремятся каждый процесс проводить от начала до конца не прерываясь. Максимально концентрируют свое внимание на процессе, с трудом отключаются от него и с трудом включаются в прерванный процесс."
);

const Sign result = Sign(
    name: "Результат",
    desc: "Легко занимаются несколькими делами одновременно, переключаясь с одного на другое. Им сложно оценить насколько успешен процесс, поэтому они склонны подводить промежуточные итоги."
);

const Sign compliance = Sign(
    name: "Уступчивость",
    desc: "Уступчивые, реализуя свои интересы, объективно оценивают все необходимые для этого ресурсы и в случае нехватки ресурсов могут отказаться от какой-то части своих интересов. В совместных делах могут «давать фору» партнеру, рассматривать встречные предложения."
);

const Sign stubbornness = Sign(
    name: "Упрямость",
    desc: "Упрямые для реализации своих интересов и намерений изыскивают любые возможные ресурсы."
);

const Sign carelessness = Sign(
    name: "Беспечность",
    desc: "Попадая или планируя новую ситуацию, используют только ту информацию, которая присутствует в этой ситуации, не опираясь на свой опыт. Считают, что все предусмотреть невозможно."
);

const Sign prudence = Sign(
    name: "Предусмотрительность",
    desc: "В новой ситуации предусмотрительные предпочитают использовать весь свой опыт, в т.ч. и не относящийся к конкретной ситуации. Стремятся заранее предусмотреть ситуацию."
);

const Sign democracy = Sign(
    name: "Демократизм",
    desc: "Демократы воспринимают человека через его индивидуальные качества. Отношение к человеку у демократа не базируется на его принадлежности к какой-либо группе."
);

const Sign aristocracy = Sign(
    name: "Аристократизм",
    desc: "Аристократы воспринимают человека как представителя какой-либо группы, класса. Они часто используют такие выражения как «типичный представитель», «все они такие» и т.д."
);

const Sign judiciousness = Sign(
    name: "Рассудительность",
    desc: "Для рассудительных нормальным состоянием является расслабленность. Мобилизуются для выполнения какого-либо дела непосредственно в момент начала дела. Им иногда бывает трудно мобилизоваться без внешнего стимула. Наиболее важным этапом любого дела считают процесс его обдумывания и обсуждения. Рассудительные ценят в работе физические условия и комфорт, могут отказаться от выполнения какой-то работы, если эти условия не на уровне, удовлетворяющем их."
);

const Sign determination = Sign(
    name: "Решительность",
    desc: "Решительные всегда находятся в состоянии мобилизации, наиболее важным этапом считают момент принятия решения. По окончании дела им бывает трудно расслабиться без участия других людей или каких-то дополнительных стимулов, например, вечеринки по случаю окончания дела. Ценят в работе результат и могут ради этого поступиться удобством и комфортом."
);

const Sign funny = Sign(
    name: "Веселые",
    desc: "В своих суждениях веселые опираются на то, что в любой ситуации нет единственно правильного варианта решения, склонны проводить дополнительную «сверку понятий», предполагая, что под одним и тем же словом разные люди понимают разные вещи. Веселые быстро могут сблизить психологическую дистанцию, минуя постепенные этапы сближения: знакомство, обмен информацией друг о друге."
);

const Sign serious = Sign(
    name: "Серьезные",
    desc: "Серьезные предполагают наличие общих объективных закономерностей, не зависящих от субъективных мнений. Для сокращения психологической дистанции серьезным необходимо знать имя человека, какую-то другую характеризующую его информацию."
);