import 'relations.dart';

const TypeDesc donType = TypeDesc(
    tag: "Don Quixote",
    shortName: "Дон-Кихот",
    longName: "Дон-Кихот - ИЛЭ(И)",
    altName: "Искатель",
    nameDescription: "Интуитивно-Логический Экстраверт (Иррационал)",
    mbti: "ENTP",
    moto: "Жизнь полна увлекательных задач",
    svg: "svgs/donQuixote.svg",
    routeName: "/donQuixotePage",
    description:
        "Дон-Кихоты – они, сука, обаятельные уроды. Запиздят так, что их считаешь умнее Энтштейна, идей дурацких у них – что у дурака фантиков. Однако не ведитесь, товарищи! Когда вы окажетесь по шею в грязи в таежном болоте или в балетной пачке на босу ногу посреди Тверской и с Доном по правую руку, радостно лыбящимся, как идиот, вы вспомните наш совет. Что для нормального индивида, Штирля какого, или, не побоюсь этого слова, Макса, служит поводом для немедленного самоуничтожения, то для Дона – утренняя разминочка перед Большой Аферой. У Дон-Кихота наблюдается явный дефект строения черепа – волосы растут и наружу, и внутрь, вследствие чего мозг, очевидно, перманентно чешется, а огребают на свою жопу, естественно, окружающие. Доны мнят себя гениальными бизнесменами, идеи льются из них, как говно из прорванной канализации. И все как одна оказываются провальными, потому как тактики из Донов как из свиньи балерина, в итоге они перманентно ходят с голой задницей. Общительные, любят компанию, однако как скажут – так отрежут, тонкостью восприятия отличаются разве что в собственных мечтах, а в реальности вечно ляпают не то не в том месте и не в то время. Кроме того, Дон, сука, любит заботу и внимание. И попробуйте ему их не предоставить! Мстительные они, сволочи, так что лучше сразу привыкайте носить тапочки в зубах, потому как живыми вы все одно от них не уползете. А ежели вы тапочки таки принесете, то не избежать вам обвинения в отсутствии инициативы и полета мысли. Видимо, именно ради Донов мироздание и создало Дюмку – единственный ТИМ, у которого от капризов Дона не возникает желания заехать ему этими тапочками в ебальник.",
    strongTypeDesc:
        "Изобретательность, мгновенная реакция на изменение обстоятельств, творческое отношение к юридическим и формально-логическим задачам. Объемное, целостное видение помогает ему привлекать к решение поставленной задачи методы смежных областей знания. Дон-Кихот с интересом относится к новому и охотно его внедряет. Сильное логическое мышление позволяет ему легко осваивать компьютер и адекватно оценивать бесконечные законодательные нововведения. Развитая интуиция помогает не упускать возможности момента и в то же время не начинать безнадежных дел.",
    roleTypeDesc:
        "Некоторое время Дон-Кихот может справляться с организаторской работой. Он может отбить покушение на территорию, настоять на своем. Но длительные волевые усилия ему не даются. Он устает и находит возможность удалиться. Может Дон-Кихот поддержать веселье в компании, выступить генератором эмоций. Как правило, люди этого типа знают массу забавных случаев и анекдотов. Но в сложной, эмоционально напряженной коллизии он, скорее всего, попытается действовать логическими методами.",
    weakTypeDesc:
        "Хуже всего Дон-Кихот ориентируется в человеческих отношениях и психологических тонкостях. От него скрыты мотивы поступков и признаки состояний. Он может быть довольно неуклюжим в общении и ненароком обидеть собеседника. Это не зависит от воспитания. Просто ему сложно одновременно строить сложнейшие смысловые конструкции и отслеживать этическое поле беседы. Сложно Дон-Кихоту также определять конкретные качества объектов. Его ощущения нечетки, реакции на состояние организма запаздывают.",
    bestPractice:
        "для Дон-Кихота - исследования. В любую деятельность он вносит элемент изобретательства. Классические образцы этого типа - А. Эйнштейн, Д. Менделеев, К. Циолковский. Но и в другие виды деятельности Дон-Кихот может привнести оригинальность и острый ум. Например, М. Задорнов на эстраде по сути обнажает именно смысловые сбои людей, проявляемую ими глупость.\n    Мне встретилась девушка Дон-Кихот, с увлечением работавшая дефектологом. Она очень гордилась тем, что максимально развивала возможности больных детей. И можно быть уверенным, что такая уникальная работа вполне соответствует ее типу.",
    worstPractice:
        "Дон-Кихоту работа, связанная с активным длительным общением, где требуется определенный психологизм. В такой обстановке Дон-Кихот испытывает тяжелые перегрузки. Например, такие высоко профессиональные экономисты, как E. Гайдар и Г. Явлинский (оба Дон-Кихоты), именно в политических интригах не сумели проявить свой блестящий интеллект. Неуместная обидчивость и прямолинейность делают их легкой добычей политических противников. В ситуации этического давления для Дон-Кихота характерно переходить из режима поиска истины в режим изобличения предательства. И это резко снижает впечатление о нем у окружающих.\n    Юноша Дон-Кихот рассказал мне такую историю. «Я был способным студентом, и мне предложили поработать с психологами. Нас выбрали 21 человека из нескольких сотен. Три месяца нас обучали, а потом мы начали работать с людьми. Учился я отлично, а вот люди, пришедшие на прием, на меня жаловались. Потому что я быстро понимал, что они мне врут, и прямо так им и говорил: «Не врите мне, говорите правду, тогда мы легче найдем решение вашей проблемы». Ну, я, правда, так думаю. Мне пытались объяснить, что надо принимать их ложь и с нею как-то работать. Но я уже понял, что психология не для меня».\n    От постоянных упреков в нетактичности и необходимости проявлять заботу о ком-то Дон-Кихот может утратить интерес к жизни или работе. Ему не показаны профессии с длительным непредсказуемым общением и оформлением конкретных объектов.",
    forEffectiveWork:
        "такому сотруднику необходимо обеспечить комфортные условия труда, уверенность в хорошем к нему отношении, уважении. Ни в коем случае не включать его в выяснение отношений в коллективе.",
    extraversion: true,
    logic: true,
    intuition: true,
    rationalization: false,
    relations: <Relation>[
      equalRelation,
      dualRelation,
      activationRelation,
      mirrorRelation,
      performerRelation,
      underControlRelation,
      businessRelation,
      mirrorRelation,
      superegoRelation,
      oppositeRelation,
      quasiRelation,
      conflictRelation,
      customerRelation,
      controlRelation,
      familyRelation,
      semiDualRelation
    ]);

const TypeDesc dumasType = TypeDesc(
    tag: "Dumas",
    shortName: "Дюма",
    longName: "Дюма - СЭИ(И)",
    altName: "Миротворец",
    nameDescription: "Сенсорно-этический интроверт (Иррационал)",
    mbti: "ISFP",
    moto: "Все видит, но ни во что не вмешивается",
    svg: "svgs/dumas.svg",
    routeName: "/dumasPage",
    description:
        "Дюма – они, сука, положительные такие, что оторопь берет. Непрошибаемые, как танк, спокойные, как айсберг перед встречей с «Титаником», лыбятся по-монолизовскив ответ на любой выебон, и все им как с гуся вода. Надо сказать, что ассоциации с названием ТИМа возникают самые что ни на есть авантюрно-приключенческие – подвески, кони, люди, королевская милость, все за одного и прочая хуйня; а на самом деле скучнее, чем Дюмки, могут быть только Габены. И то Габа при желании можно приставить к делу, и он будет торчать, где оставили, а вот Дюмку фиг заставишь – при всей показной тихушности в голове у нее есть четское представление об идеальном мире. И мир этот напоминает кухню с большой плазмой над плитой. Что мы можем сказать об этих идеальных существах? Раздражают они нас страшно, потому что отсутствие недостатков неизменно настораживает и заставляет подозревать неладное. Никакого двойного дна в Дюмке нет, и не ищите; ни острых углов, ни пошлых желаний, ни даже тайной порочной любви к портрету Бори Моисеева. Несмотря на иррациональность, жизнь их протекает распланированно, спокойно и последовательно, будто на обложке журнала «Настоящая женщина» (кстати, пол особого значения в данном случае не имеет); а в промежутках между приготовлением обедов, воспитанием детей и работой в какой-нибудь неприметной организации они успевают еще подобрать пару брошенных щенков/котят/головастиков. Родились они явно с серебряной поварешкой в заднице и нимбом на башке, и потому вечно хотят принести пользу ни в чем неповинному человечеству, но эдак ненавязчиво, в отличие от своих прямых конкурентов-Достов, чью помощь попробуй только не принять – мало не покажется.",
    strongTypeDesc:
        "Дюма обладает хорошим вкусом, чувством меры, волей и усидчивостью. Может правильно оценить качество любого продукта и в деталях это объяснить. Заботлив и внимателен к людям, способен создать комфорт в близком окружении. Дюма дипломатичен, умеет убеждать, склонен к бесконфликтному решению вопросов. Эмоционально устойчив, миролюбив, может правильно оценить и отрегулировать отношения окружающих. Экспертно определяет физическое и психическое состояние собеседника.",
    roleTypeDesc:
        "Дюма может быть точным, правильно рассчитывать время и отслеживать его. Способен достаточно ясно видеть ближайшие последствия принятых решений. Чувствует последние стилевые тенденции, любит модных авторов. Но долгосрочные прогнозы ему не удаются. Может он освоить и выполнять формально-логические и юридические требования. Также Дюма охотно осваивает работу с компьютером, если рядом хороший педагог. Ему вполне доступна работа со стандартными программами и даже создание собственных, но при участии опытного консультанта.",
    weakTypeDesc:
        "Сложнее всего Дюма ориентируется в вопросах, связанных с экономикой, технологией, выгодой и целесообразностью. Он теряется перед сложным, технологически не проработанным заданием, плохо оценивает необходимые масштабы затрат. Сложно ему и руководить большим коллективом. Сметы, технологии, бухгалтерия – это то, что вгоняет человека такого типа в жесткий стресс. Не менее сложна для Дюма ориентация в состоянии неопределенности. Он не может найти нестандартный выход из ситуации, не готов к неожиданным переменам, не умеет быстро освоить большой массив информации. Рискованные финансовые операции не его стихия. Во всех сложных для себя случаях человек этого типа полагается на свое мение и обращается к окружающим, которые, как правило, суловольствием ему помогают.",
    bestPractice:
        "для Дюма - все виды искусства, забота людях, рукоделие. К этому типу относятся такие известные люди как Е. Леонов. Л. Федосеева-Шукшина, Б. Окуджава, М. Жванецкий, В. Пельш. Известный британский комик Бенни Хилл тоже Дюма.\n   В моей практике встретились два хирурга типа Дюма. Один в детской больнице, другой — в онкологической. Оба прекрасно справлялись с переживаниями родственников, твердой рукой проводили операции, прекрасно чувствовали состояние пациентов. Дело в том, что все технологические тонкости предстоящих операций (что, собственно, и составляет основную трудность для людей этого типа) прорабатываются заранее до полной ясности с ведущими профессорами. А воли, гуманизма и терпения, нужных для непосредственной работы хирурга, представителям этого типа не занимать.",
    worstPractice:
        "Дюма работа, связанная с финансами, она может постепенно разрушить и его самого, и дело, которое ему поручено. Типичны для бухгалтера Дюма запущенная отчетность, пробелы в документах, нехватка времени для отслеживания новейших постановлений и неумение их применить, если даже ему кто-то о них рассказал. К сожалению, таких примеров немало. За два-три года такой нервной деятельности у прежде обаятельного человека портятся отношения с сослуживцами и начинают «всплывать» хронические болезни.\n    Людям этого типа не показаны профессии, связанные с технологическими и финансовыми рисками и с принятием ответ: ственных экономических решений в условиях неопределенности.",
    forEffectiveWork:
        "такому сотруднику необходимо предоставлять четко разработанные правила, технологии, должно ные инструкции. Ни в коем случае нельзя заставлять его разрабатывать новые технологические приемы. бизнес-планы, недопустимо ругать его за неверно предпринятые действия в ситуации неопределенности.",
    extraversion: false,
    logic: false,
    intuition: false,
    rationalization: false,
    relations: <Relation>[
      dualRelation,
      equalRelation,
      mirrorRelation,
      activationRelation,
      underControlRelation,
      performerRelation,
      mirageRelation,
      businessRelation,
      oppositeRelation,
      superegoRelation,
      conflictRelation,
      quasiRelation,
      controlRelation,
      customerRelation,
      semiDualRelation,
      familyRelation
    ]);

const TypeDesc hugoType = TypeDesc(
    tag: "Hugo",
    shortName: "Гюго",
    longName: "Гюго - ЭСЭ(Р)",
    altName: "Энтузиаст",
    nameDescription: "Этико-сенсорный экстраверт (Рационал)",
    mbti: "ESFJ",
    moto: "Воплощенная ответственность",
    svg: "svgs/hugo.svg",
    routeName: "/hugoPage",
    description:
        "Гюго – они, сука, оптимисты до мозга кости, массовики-затейники от бога. Они всегда в тонусе, вечно на подъеме, и нет, допинг тут не при чем – как трезвые, так и пьяные, Гюги одинаково благожелательно настроены к неблагодарному человечеству. А оно, человечество это порой хочет просто посидеть за книжкой или там подумать о вечном, что Гюга, находясь рядом, терпеть просто не может. Вас покормят, развеселят, расскажут десять анекдотов и страшно обидятся, если вы не оцените их усилий – ко всему прочему Гюги обидчивы и тонки душой, если повода смертельно оскорбиться нет, то они с удовольствием высосут его из пальца. Потому, когда на вас из-за спины напрыгивает этакое нечто в карнавальном костюме и принимается громко петь футбольные кричалки, рекомендуется изображать безумную радость, а то будет хуже – обиженный Гюго еще страшнее, чем расстроенный Дост. Впрочем, в глубине души Гюге глубоко плевать на всех, кроме себя, может, оттого они по жизни любвеобильны, словно озабоченный павиан, значения таких глупых понятий, как верность или постоянство, искренне не понимают, и на вопрос о предпочтениях отвечают «всегда». Надо признать, это и к лучшему – энтузиазма Гюго слишком много, чтоб его напор мог выдержать один человек, не тронувшись маленько от вечного праздника жизни. Как ни странно, многих Гюги своей неуемной активностью раздражают, и в этом трагизм данного ТИМа – вреда от них мирозданию никакого, на жисть не жалуются, по мозгам не ездят, с собой не кончают по три раза на дню, а все туда же – вынести их дольше получаса и без выпивки сложновато. Зато кто Гюг обожает – так это Гексли, которые им словно братья-близнецы.",
    strongTypeDesc:
        "Огромный энтузиазм, способный увлечь множество народу, и воля, чтобы проломить пaccивность оставшихся. Истремление охватить своей заботой всех попавших в поле зрения нуждающихся. Гюго хорошо оценивает энергетику людей, видит даже тщательно скрывае мые отношения, умеет нагнетать или рассеивать нужную ему атмосферу. Так же хорошо чувствует он и физическое состояние окружающих, качество продуктов, удобство и комфортность интерьера. Люди этого типа легко и творчески подходят ккулинарии, ремонту, клечению людей и крукоделию. Они прекрасные идеологи и очень упорны в создании должного эмоционального настроя на своей «территории».",
    roleTypeDesc:
        "Гюго неплохо усваивает готовые техпологические рецепты и любит объяснять окружающим, как нужно что-то делать правильно. Проследить за точным соблюде нием технологии, составить несложную смету по образцу, заполнить стандартный документ вполне в его силах. С интересом относится человек этого типа и к оригинальным идеям. Если они предлагаются уважаемым человеком или авторитетным изданием, Гюго готов подхватить необычное начинание и помогать его воплощению.",
    weakTypeDesc:
        "Сложнее всего людям этого типа строго соблюдать временные рамки. Вовремя прийти, уложиться в отведенное время, успеть выполнить много дел в сжатые сроки — задачи, способные довести в общем-то выносливого Гюго до полного изнеможения. Обычно, чтобы избежать стрессов, люди этого типа выделяют дополнительное время для сборов «на всякий случай», чтобы непредвиденные обстоятельства не задержали их в пути. К тем же временным аспектам относятся трудности их общения с людьми разных поколений. Например, они долго не замечают, что их дети уже выросли. Сложно им также разобраться в хитросплетениях формальной логики. К этому занятию они относятся с энтузиазмом, но легко путают квазилогические рассуждения с истинными.",
    bestPractice:
        "для Гюго – забота о большом количестве людей. Его энтузиазм и интерес к человеческим отношениям неистребимы. Растормошить, накормить, оздоровить, обучить десятки людей – вот способы его творческой реализации. Ярким примером людей этого типа, вполне реализовавших свой общественный темперамент, являются апостол Павел, в наши дни - М. Норбеков, а также прекрасные артисты С. Садальский, Н. Гундарева, А. Гольданская. Не менее успешно Гюго реализуются в профессиях врачей, учителей, менеджеров по персоналу.\n    В моей практике встретился Гюго-кинооператор. Присущее людям этого типа эстетическое чутье блестяще проявлялось в его киносюжетах. Видеоряд сопровождался музыкой, создающей подходящий настрой, — все было очень тонко и красиво. А еще он мог на Масленицу напечь коллегам блинов. Так, между делом, для настроения.",
    worstPractice:
        "Гюго работа в жестком ритме, да еще с формально-логическими объектами. Например, жесткое требование к соблюдению сроков (поезд ждать не будет!) приведет к тому, что Гюго появится на перроне за час до отправления. Разумеется, если такие требования возникают каждый день, человек будет пребывать в постоянном стрессе. Известен случай, когда женщина Гюго занималась копированием фильмов. Каждые три часа она должна была менять кассеты в дюжинe видеомагнитофонов. Работа нетрудная и по тем временам доходная. Но постоянная привязка к месту и жесткое соблюдение графика через пару лет привели ее к полной потере интереса к жизни. Она запустила дом и даже перестала готовить, что для людей этого типа является серьезным отказом от творческого самовыражения.\n    Людям этого типа не показаны профессии с жесткими временными рамками или непредсказуемыми сменами ритмов. Также тяжелы для них формальные задачи, исключающие общение с людьми.",
    forEffectiveWork:
        "такому сотруднику необходимо предоставить четкие правила работы, ясные требования. Ни в коем случае его нельзя торопить, резко менять планы, требовать перспективного планирования.",
    extraversion: true,
    logic: false,
    intuition: false,
    rationalization: true,
    relations: <Relation>[
      activationRelation,
      mirrorRelation,
      equalRelation,
      dualRelation,
      familyRelation,
      semiDualRelation,
      customerRelation,
      controlRelation,
      quasiRelation,
      conflictRelation,
      superegoRelation,
      oppositeRelation,
      businessRelation,
      mirageRelation,
      performerRelation,
      underControlRelation
    ]);

const TypeDesc robespierreType = TypeDesc(
    tag: "Robespierre",
    shortName: "Робеспьер ",
    longName: "Робеспьер  - ЛИИ(Р)",
    altName: "Аналитик",
    nameDescription: "Логико-интуитивный интроверт (Рационал)",
    mbti: "INTJ",
    moto: "Все можно улучшить",
    svg: "svgs/robespierre.svg",
    routeName: "/robespierrePage",
    description:
        "Робеспьеры – они, сука, умные. Но если Дон умный от балды, и над его бредом иногда можно даже посмеяться – когда выйдешь из больницы – то Робы умные в натуре. И это в них так бесит! Рассуждающего и строящего логически цепочки Роба хочется прибить чем-нибудь тяжелым, возможно – тем же Жуком или Габеном. К тому же Робеспьеры занудны до рвоты и упрямы как ослы. Вбив себе что-то в голову, они непременно донесут это до вас несколько раз; самое интересное, что их аргументы совершенно верны, однако они ухитряются сделать из них неправильные на взгляд обычного человека – из тех, у кого в голове мозг, а не вычислительный центр с вибратором — выводы. Выдержать их гундеж без поллитры нереально, потому легче всего общаться с Робом в большой компании и недолго. В личной жизни Робы являют собой чмо с извращенными вкусами, уверенное, что с десяток знойных мулаток ждет не дождется их бесценного внимания. На деле внимания их обычно дожидается нечто аналогично унылое типа Баля или Доста, потому что дуалы, полудуалы и иже с ними обходят Робов сторонкой – увлекательный рассказ о синхрофазатроне не всегда затронет сердце девушки, что неизменно Робов изумляет. В работе они, сука, успешны, ибо вгрызаются в нее, как хомяки-убийцы; чего не скажешь о прочих сторонах жизни, в которых Робы ведут себя, как белка в сексшопе. А еще им крайне повезло с дуалами – те тоже выглядят со стороны, как ушибленный атомным взрывом танк, но, в отличие от Роббеспьеров, этим крайне гордятся.",
    strongTypeDesc:
        "Экспертная формальная логика в сочетании с объемным целостным видением задачи. Робеспьер — прекрасный систематизатор самых запутанных и многофакторных явлений. Он адекватно воспринимает как дух, так и букву любых законов и инструкций и может творчески применить их или обойти, если это хоть в малейшей степени возможно. Его предчувствия вполне заслуживают доверия. Он настроен на жесткую экономию ресурсов и не любит платить «за воздух». Порядок – основа его личности, и можно быть уверенным, что по всем важным для него вопросам у Робеспьера имеется полная ясность и объясняющая концепция. Человек этого типа умеет составлять расписания и сложные сетевые графики, чтобы максимально использовать каждую единицу времени.",
    roleTypeDesc:
        "Робеспьер умеет произвести впечатление прекрасно воспитанного человека, тактично поговорить, показать доброжелательное отношение. Могут люди этого типа и хорошо готовить, аккуратно рукодельничать и мастерить, если этому обучили их хорошие наставники. При этом на завтрак изо дня в день Робеспьер может подавать одно и то же добротно приготовленное и достаточно полезное блюдо. В вопросах же человеческих отношений при сложных проблемных коллизиях Робеспьеры предпочитают с зыбкой почвы гуманизма переходить на твердые основания принципов справедливости.",
    weakTypeDesc:
        "Сложнее всего людям этого типа выносить силовое давление и агрессию окружающих. Они не могут удержать свою территорию в присутствии «напирающего» партнера. Силовые методы, жесткая дисциплина, решительное оттеснение конкурентов - методы, вызывающие серьезные стрессовые нагрузки у людей этого типа. Не могут они также противостоять напору эмоций - легко идут на поводу как у бурных восторгов, так и у кровных обид. С таким сочетанием «слабостей» связана постоянная забота Робеспьеров о том, как избежать жестокостей этого мира. Именно они чаще, чем люди других типов, изобретают совершенные общественные системы и пишут справедливые конституции.",
    bestPractice:
        "для Робеспьера — поиск смысла и систематизация больших массивов информации. По общему мнению, к этому типу принадлежал блестящий ученый А. Сахаров. Другой яркий образец того же типа в политике – И. Хакамада.\n    Неплохо справляются они ис работой в условиях недостатка данных, требующей мгновенной реакции на внезапно промельк-нувшую возможность. Успешными могут быть представители этого типа и в профессиях, где можно проявить аналитические способности и интуицию. Так, Робеспьер А. Гордон делает весьма успешные передачи на TV, которые опираются как раз на интеллект зрителей, а не на их инстинкты.\n    Мне знаком человек этого типа, который занимается бойскаутским движением. Он регулярно возит подростков на международные слеты. Причем особенностью его подхода являются поездки, например в Копенгаген, не самолетом, а через пять границ по множеству городов с прогулками и ночными электричками. Таким образом дети повидали пол-Европы.\n   Другой мой знакомый Робеспьер — искусствовед. Он более 10 лет занимается поисками антиквариата по рынкам и деревням - и вполне успешно. Согласитесь, построить стабильный бизнес на таком зыбком основании: найдется ли на старом чердаке ценная историческая вещь — не каждому под силу. Но люди этого типа чувствуют себя реализованными именно в таких условиях.",
    worstPractice:
        "Робеспьеру работа под жестким контролем или в силовых структурах. Робеспьеры, побывавшие в армии. с содроганием вспоминают этот опыт. Часто они гордятся, что нашли возможность избежать драк и разборок. Кстати, своей способностью избегать физических опасностей Робеспьеры очень дорожат. Так же оберегают они свою своеобразно воспринимаемую свободу. Я знаю человека этого типа, который продал машину, как только ясно осознал, что милиция на дороге может сделать с человеком что угодно.\n    Людям этого типа не следует поручать работу, связанную с волевым воздействием на людей, с завоеванием новых территорий (в любом смысле этого слова), с эмоциональным натиском или необходимостью сдерживать таковой. Любые усилия на перечис ленных поприщах приведут к постепенному распаду личности.",
    forEffectiveWork:
        "такому сотруднику необходимы эмоциональное зажигание, забота об удобных условиях, правильном питании. Совершенно недопустимо волевое давление. Нельзя заставлять Робеспьера действовать методами, которыми он не владеет.",
    extraversion: false,
    logic: true,
    intuition: true,
    rationalization: true,
    relations: <Relation>[
      mirrorRelation,
      activationRelation,
      dualRelation,
      equalRelation,
      semiDualRelation,
      familyRelation,
      controlRelation,
      customerRelation,
      conflictRelation,
      quasiRelation,
      oppositeRelation,
      superegoRelation,
      mirageRelation,
      businessRelation,
      underControlRelation,
      performerRelation
    ]);

const TypeDesc hamletType = TypeDesc(
    tag: "Hamlet",
    shortName: "Гамлет",
    longName: "Гамлет - ЭИЭ(Р)",
    altName: "Наставник",
    nameDescription: "Этико-интуитивный экстраверт (Рационал)",
    mbti: "ENFJ",
    moto: "Мастера убеждения",
    svg: "svgs/hamlet.svg",
    routeName: "/hamletPage",
    description:
        "Гамлеты – они же, сука, трагичные все из себя. Обладают, как правило, большими глазами, тонким профилем, и вообще такие дышащие духами и туманами. Однако будьте настороже: весь этот пафосный бред скрывает депрессивное чмо, которое ненавидит всех и вся еще почище Драев. И, в отличие от последних, умеет этим пользоваться, ибо принципы там и не ночевали. Поголовно мнят себя великими актерами, даже если их на пушечный выстрел никогда не подпускали к гримерке; умеют красиво встряхивать башкой и горько улыбаться, особенно часто делают это, если просят денег, а денег они будут просить часто, ибо зачем же духовным людям заморачиваться на презренном бабле. По сути, Гамы – вдохновенные распиздяи, но втайне этого стыдятся, и, в отличие от Геков, пытаются изобразить из себя трудоголика такого, шо писец. Получается хреново, от чего Гамлеты впадают в еще больший ступор и принимаются красиво депрессовать, кончать с собой или декламировать стихи (иногда одновременно), а если вам особо не повезло – еще и петь тихим голосом. Или не тихим. Из любой фигни вроде заусенца или потекшей туши Гам сделает трагедию вселенского масштаба, причем оторванная пуговица в пересказе превратится в падение бомбардировщика аккурат на гамлетовское пальто. Пальто будет непременно черным, ибо Гамы носят траур по этому миру, а еще опять забыли постирать. Озабочены и этого не скрывают, дадут с полпинка, изобразят африканскую страсть, однако не льстите себе: Гамлет, как хороший режиссер, старается ставить спектакли по возможности в разных театрах, чтоб срубить побольше бабла и аплодисментов. А без публики Гам, как фикус без окурка – не функционирует, временно косплея Еся и прикидываясь невинно убиенным веником.",
    strongTypeDesc:
        "Яркая энергетика и очень быстрая реакция. Гамлет — любитель экстремальных задач, требующих напряжения нервов и скорости. Он любит состояние энтузиазма и умеет адекватно использовать возникший адреналин. А если вокруг собрались зрители, то все они будут вовлечены в стихию страсти и бурных эмоций. Умеющий зажечь сколько угодно народу, Гамлет часто выбирает актерское, музыкальное или идеологическое поприще. Тем более, что угадывать тенденции развития общественных ожиданий для него любимое и успешное занятие. Это его сильная сторона, поэтому он видит модные тенденции, авторов, которых полюбит публика завтра, идеи, которые удовлетворят народные чаяния. Люди этого типа хорошо чувствуют исторические эпохи и могут ярко и образно рассказывать, например, о жизни ацтеков или двора Людовика XIV.",
    roleTypeDesc:
        "Может Гамлет усвоить хорошо объясненные технологические приемы и рассказать о них благодарным слушателям. Прекрасно имитирует деловой стиль, демонстрирует предприимчивость. Может увлекаться силовыми сторонами жизни, если есть кто-то, кто дает такие образцы. Сам не обладая настоящей волевой сенсорикой, он может при поддержке продемонстрировать и агрессивность, и «наезды» на чужую территорию. Конечно, встретив сопротивление, он уступит. Но по его виду догадаться об этом сложно.",
    weakTypeDesc:
        "Труднее всего людям этого типа дается плотный контакт с конкретными проявлениями жизни. Они слабо ориентируются в своих собственных ощущениях, им нелегко понять, здоровы ли они или слегка прибoлeли, голодны, замерзли или просто устали сидеть в неудобной позе. Что уж говорить о состоянии других! Гамлет старается отложить до последней возможности принятие ответственного решения, даже если речь идет о здоровье детей или о выборе цвета обоев. Он опасается попробовать вчерашнее молоко, чтобы не отравиться, не знает, как одеться по погоде. Вопросы бытового характера люди этого типа стремятся обойти либо объявляют «мещанством». Примерно такую же неуверенность ощущает Гамлет в формальных вопросах, несмотря на большой интерес к ним. Ему не даются Творческие задачи, методы решения которых тоже требуется сначала изобрести.",
    bestPractice:
        "для Гамлета - яркие публичные выступления, виртуозное управление эмоциями людей приносит ему заслуженное признание. Таковы А. Райкин, Ф. Киркоров, В. Жириновский. Но не меньшего успеха может добиться Гамлет. применяя свою интуицию в исторической науке. Так, работы Н. Гумилева и Э. Радзинского открыли людям в истории совершенно неожиданные ракурсы. Хотя и по-разному.\n    Яркое обаяние Гамлета помогает ему добиться успеха там, где он зависит от отношения начальства. Я знала женщину Гамлета, которая в советские времена очень успешно сделала карьеру ведущего экономиста в Институте цен при Госкомцен СССР. Диссертация, десятки научных работ, заведование отделом — в те времена в таком месте для такой карьеры требовались, конечно, скорее политические, чем экономические таланты.",
    worstPractice:
        "Гамлету конкретная работа по доводке и оформлению, выхаживанию и отделке. Не может он также выдержать деятельности по систематизации и обоснованию, кропотливой и заведомо лишенной зрителей.\n    Известен случай, когда родители, окончившие МФТИ, направляли туда всех своих детей. Две девочки логических типов успешно справились с учебой. А вот сын оказался Гамлетом. Конечно, хорошо подготовленный, он туда поступил и даже проучился два курса. И завяз. Просто его таланты лежат в другой плоскости человеческой культуры. Он красив, общителен, музыкален, умеет зажечь компанию энтузиазмом, артистичен и энергичен. Но сложнейшие программы Физтеха опираются на другие качества личности, поэтому нашему герою трудно себя проявить. Интерес к учебе у него падает до нуля, а без интереса такие программы не осилить.\n    Другой случай. Родители из практических соображений направили сына Гамлета обучаться ландшафтному дизайну. Парень привык к учебе, так как семья академическая, и упорно осваивал эту ботанику, которая в него «не лезла». За год учебы он совершенно «погас», и родители решились поменять ему профориентацию. Сейчас он занимается музыкой, что-то сочиняет. «Его не оторвешь от инструмента», - гордо рассказывает мать.",
    forEffectiveWork:
        "такому сотруднику необходимо объяснять правила работы, возможно, оказывать волевое воздействие. Ни в коем случае нельзя критиковать его внешний вид, обсуждать плохое самочувствие. Гамлет нуждается в комфортных условиях работы, ненавязчиво рекомендуемом правильном питании.",
    extraversion: true,
    logic: false,
    intuition: true,
    rationalization: true,
    relations: <Relation>[
      customerRelation,
      controlRelation,
      familyRelation,
      semiDualRelation,
      equalRelation,
      dualRelation,
      activationRelation,
      mirrorRelation,
      performerRelation,
      underControlRelation,
      businessRelation,
      mirageRelation,
      superegoRelation,
      oppositeRelation,
      quasiRelation,
      conflictRelation
    ]);

const TypeDesc maximGorkyType = TypeDesc(
    tag: "MaximGorky",
    shortName: "Максим",
    longName: "Максим - ЛСИ(Р)",
    altName: "Инспектор",
    nameDescription: "Логико-сенсорный интроверт (Рационал)",
    mbti: "ISTJ",
    moto: "Делай, что должно",
    svg: "svgs/maximGorky.svg",
    routeName: "/maximGorkyPage",
    description:
        "Максимы – они просто суки, и добавить к этому нечего. В глубине души Максимы знают, что мир устроен неправильно, и УЖ ОНИ-ТО ЗНАЮТ, как его исправить – а потому вся их активная деятельность направлена на то, что портить жизнь окружающим, активно их исправляя. В отличие от Драев, Макс не будет зря орать и биться в истерике – он просто прикажет, и попробуйте не подчиниться: таких беспогонных генералов, придирающихся к любой фигне, надо поискать. У Максимов все должно быть так, как надо, но вместо того, чтоб тихо организовывать свой рациональный рай самостоятельно, они активно припахивают к работе всех, кто под руку попадется. Несмотря на сенсоризм, вкус в Максиме отсутствует от рождения, зато имеется смекалка, благодаря которой на люди он выходит всегда в строгом костюме, руководствуясь, видимо, тем мнением, что хороший костюм даже владельцем не испортишь. К слову, в личном романтики в Максе ни на грош, зато формальности он соблюдет с удовольствием – правда, после свадьбы этот сухарь не преобразится в любящего супруга, он так и останется сукой, которого может вывести из себя криво сложенная салфетка. Еще Максы корыстны до неприличия, что удачно сочетается с почти полным отсутствием интереса к делам сердечным, помимо удовлетворения физиологических нужд. Брак по расчету – то, что нужно их страждущей рациональной душе. А вот что они любят, так это работать – с утра и до поздней ночи, дятлы-энтузиасты страшные, тот тип одержимого начальника, который оштрафует на ползарплаты за пятиминутное опоздание, а за любой промах сначала наорет, а потом сделает все сам. С первого взгляда кажется, что Макс логичен до неприличия, но по сути он настолько зациклен на себе любимом, что вывести его из состояния вечной медитации на собственный мозг может только что-то действительно из ряда вон выходящее, например, такое чудо в перьях, как Гам.",
    strongTypeDesc:
        "Желание и способность достичь в любом вопросе полной ясности и настоящая сила воли в классическом ее понимании. Люди типа Максим не оставляют неясностей в тылу. Все, что происходит или происходило, они объясняют себе, создавая непротиворечивую концепцию. Они последовательны, придают огромное значение договорам, методичны, скрупулезны. Как правило, Максим не бегает от ответственности за свою территорию и насаждает там порядок довольно жестко. Зато это настоящий порядок: все документы рассортированы, люди подробно проинструктированы, графики неукоснительно соблюдаются, справедливость гарантируется. Максим хорошо осознает свои права и обязанности, поэтому легко вписывается в любую иерархию. Он исполнительный подчиненный и бескомпромиссный начальник.",
    roleTypeDesc:
        "Максим легко усваивает правила хорошего тона и умеет применить их при случае. Он может поддерживать общение, побыть некоторое время душой общества, но для него это скорее труд, чем удовольствие. Если работа с клиентами требует определенного психологизма и сочувствия, они будут проявлены. Но для разрешения серьезных споров Максим предпочтет юридические методы политическим или психологическим. Также может он поддержать новую мысль или модную идею, если их представляет заслуживший его доверие человек.",
    weakTypeDesc:
        "Сложнее всего людям этого типа дается пребывание в состоянии неопределенности. Принимать важное решение, располагая неполными или не вполне достоверными данными, для них мучительно. Все, что нельзя просчитать, вызывает их опасения и отвергается. Трудно им проявить и эмоциональную устойчивость - они бессознательно программируются на жалость или чужой энтузиазм и могут быть втянуты в ненужные им отношения. Веселые, жизнерадостные люди могут получить безосновательные поблажки от принципиального Максима, но люди, не умеющие четко обосновать свои предчувствия, — никогда. Он не станет прислушиваться к советам, которые недостаточно обоснованы логически.",
    bestPractice:
        "для Максима - любая скрупулезная формальная работа. Максим - хранитель смыслов и законов. Его второй псевдоним - Инспектор. Он прекрасный аудитор любого уровня (Ю. Болдырев), серьезный аналитик (Е. Киселев), хороший, строгий организатор (Н. Михалков). И даже если он киноактер, как Ален Делон, то играет, как правило, парней, делающих ставку на волю и разум.\n    Я знакома с человеком этого типа, программистом по профессии. Жизнь долго заставляла его работать директором нескольких фирм. Он приложил немало смекалки, чтобы минимизировать «человеческий фактор» в своей работе. «Я им сделал такие программы, что они просто не могут нажать не туда. В опасных местах курсор гаснет, как в детских игрушках». Он был несказанно счастлив, когда нашел работу только с компьютерами — и никакой ответственности за людей.\n    Именно по причине предсказуемости среды Максим не плохо чувствует себя в армии. Ему нетрудно соблюдать устав, а воли и упорства человеку этого типа не занимать.",
    worstPractice:
        "Максиму работа в непредсказуемых условиях, особенно если в ней замешаны человеческие страсти.\n    Женщина Максим, практикующий психолог-консультант, за несколько лет работы растеряла все черты, присущие типу. Чужие беды настолько глубоко ее задевали, что она стала принимать и в своей жизни неразумные импульсивные решения, затронувшие ее близких. Помогая всем «несчастным», она не смогла стать стабильной опорой своим детям (что было бы естественно для ответственного Максима), а металась от одного подопечного к другому, пытаясь отозваться на каждую просьбу. Даже ее движения стали некоординированными. Когда я ее увидела, она пыталась унести в руках три предмета, которые поочередно падали на пол. Такое состояние рассеянности и бестолковости у людей этого типа можно объяснить только глубоким кризисом личности, случившимся под постоянным давлением чужих эмоций и необъяснимого поведения.\n    Людям типа Максим не показана работа, связанная с внезапными поворотами сюжета или случайными процессами. Там, где нет возможности протянуть смысловые нити, где все зависит от чужого настроения или каприза, Максим будет испытывать постоянный сильный стресс.",
    forEffectiveWork:
        "такому сотруднику необходимо эмоциональное зажигание и составление планов. Необходимо исключить потери времени, в частности на долгие разговоры. Ни в коем случае нельзя оставлять Максима в ситуации неопределенности, требовать от него рискованных решений.",
    extraversion: false,
    logic: true,
    intuition: false,
    rationalization: true,
    relations: <Relation>[
      controlRelation,
      customerRelation,
      semiDualRelation,
      familyRelation,
      dualRelation,
      equalRelation,
      mirrorRelation,
      activationRelation,
      underControlRelation,
      performerRelation,
      mirageRelation,
      businessRelation,
      oppositeRelation,
      superegoRelation,
      conflictRelation,
      quasiRelation
    ]);

const TypeDesc zhukovType = TypeDesc(
    tag: "Zhukov",
    shortName: "Жуков",
    longName: "Жуков - СЛЭ(И)",
    altName: "Маршал",
    nameDescription: "Сенсорно-логический экстраверт (Иррационал)",
    mbti: "ESTP",
    moto: "Реалисты до мозга костей",
    svg: "svgs/zhukov.svg",
    routeName: "/zhukovPage",
    description:
        "Жуковы – они, сука, как попрут, так ложись, воздушная тревога, все умерли. Не обманывайтесь их порой хрупким видом: любой Жук способен устроить писец котенку, а размеры писеца зависят исключительно от жуковских возможностей. Жук всегда сверху, если сверху вы – см. начало абзаца. Притом, суки, ранимые и нежные в душе, но пока до этой ранимости докопаешься, можешь и огрести раза. Любят экшн всяческий, в самой кошмарной жопе чувствуют себя как рыба в воде и немедленно начинают командовать парадом. Жуков вообще хлебом не корми – дай покомандовать, притом что хлеб они едят не всякий, а только самый крутой, радеют, суки, о своем бесценном здоровье, и вас этим заебут по самое не могу; умрете вы здоровым, и не факт, что нескоро. Страшные интриганы, любят воображать себя тактиками, стратегами, и еще хрен знает кем; садисты редкие, и все с улыбкой, легко и непринужденно, прожигая вас строгим взглядом «ты-низшее-существо-а-ну-делай-что-я-скаж у». Пафосны донельзя, мнят себя круче крутых яиц, крайне озабочены, что усердно скрывают и выдают за активность и сексапил. Себя несут по жизни вальяжно, как большой подарок миру, хотя, по сути, являют собой красиво упакованную бомбу с тепловым датчиком. Логики по идее, что удачно маскируют отсутствием проблеска мысли в глазах и прямым, как мозговая извилина, подходом к решению любой проблемы: рубануть с плеча и глянуть, что будет. Еще крайне бестактны и перманентно плюют в душу окружающим, выдавая это за отчаянную прямоту рубаха-парней, что роднит их с Робами, которые тоже умеют ляпнуть глупость от души, как никто.",
    strongTypeDesc:
        "Воля и разум. Люди этого типа — прирожденные лидеры, смело берущие на себя ответственность за ситуацию. Они быстро понимают, как достичь цели оптимальным путем и кому это поручить. Обладая настоящей волей, они могут добиться исполнительности от других. Их привлекают сложные логические задачи, дающие простор творчеству. А по силам им овладеть и математикой, и программированием, и менеджментом, и серьезными научными теориями. При этом они способны организовать внедрение полученных результатов. Стратегическое руководство большими коллективами тоже не составляет для Жукова проблемы. А уж найти лазейку в каком-то правиле или законе и творчески обойти его, не нарушив ни буквы, — типичное для него развлечение.",
    roleTypeDesc:
        "У людей типа Жуков случаются интуитивные прозрения. Их нельзя ожидать регулярно, но к необычным поворотам сюжета Жуков приспособится. Он может принять новую теорию, отменяющую старую, если почувствует ее большую целостность. Он любит обсуждать варианты, проявить неожиданные таланты, если найдутся поклонники. Кроме того, он может активно участвовать в веселых мероприятиях, если кто-то другой возьмет на себя роль основного генератора веселья.",
    weakTypeDesc:
        "Тонкости человеческих отношений, их мотивы и динамика начисто скрыты от людей типа Жуков. Они видят внешние признаки отношений, но не понимают, как их сместить в ту или иную сторону. Их одинаково удивляет и «Внезапное» предательство и «неожиданно» вспыхнувшее чувство. Жуков болезненно переносит интриги вокруг себя и, как правило, пресекает их железной рукой. Тонкости психологического подхода ему не удаются. Сложно ему также уследить за течением времени. Его легко отвлечь, нарушить построенные планы. Он программируется на новизну и скорость и в режиме нехватки времени может принять необдуманное решение.",
    bestPractice:
        "для людей этого типа – руководящая. Жуков прирожденный хозяин, что заметно уже в детском саду. Такие личности как Петр I, М. Ломоносов, С. Королев, Ю. Лужков - образцы реализации потенциала этого типа. Да и собственно маршал Г. Жуков тоже достаточно характерный представитель этого типа.\n    Но и в искусстве этот тип представлен весьма ярко: М. Ульянов, К. Лавров, Р. Маркова, Л. Зыкина, А. Шварценеггер. Все это сильные и цельные личности, живущие достаточно трудно из-за отсутствия гибкости и дипломатичности. В. Черномырдин на одном полюсе, Земфира на другом - очень разные, но в чем-то очень похожие люди.\n    Заместитель директора крупного медицинского центра, женшина типа Жуков, говорила нам: «Как бы хорошо было иметь точные критерии, подойдет человеку эта работа или нет. А то просят принять чьих-то протеже, я вижу, что она не сможет здесь работать. а оснований для отказа нет». Это как раз типичная для прямолинейного Жукова проблема - дипломатическая.",
    worstPractice:
        "Жукову деятельность, где постоянно приходится разбираться в тонкой вязи этических коллизий. Их решения всегда логичны, но могут начисто игнорировать гуманитарную составляющую сюжета. Иногда окружающие принимают это за цинизм. Вот пример. Юноша-программист типа Жуков, услышав, что коллизия пьесы Шварца «Обыкновенное чудо» заключалась в том, что влюбленные не могли поцеловаться, а то герой превратится в медведя, немедленно предложил выход. «Так может им не целоваться, а только трахаться?»... Да, так задача, безусловно, решается, но где поэзия?\n    Из сказанного понятно, что профессии, требующие терпеливого вживания в психологию клиента, для Жукова не подходят. Трудно ему и быстро менять планы, переключаясь на разные виды работ, а также действовать при постоянном поторапливании.",
    forEffectiveWork:
        "такому сотруднику необходимо планирование его деятельности и эмоциональное зажигание. Ни в коем случае нельзя проявлять к нему неуважение, требовать особой тонкости и обходительности с клиентами.",
    extraversion: true,
    logic: true,
    intuition: false,
    rationalization: false,
    relations: <Relation>[
      businessRelation,
      mirageRelation,
      performerRelation,
      underControlRelation,
      activationRelation,
      mirrorRelation,
      equalRelation,
      dualRelation,
      familyRelation,
      semiDualRelation,
      customerRelation,
      controlRelation,
      quasiRelation,
      conflictRelation,
      superegoRelation,
      oppositeRelation
    ]);

const TypeDesc yeseninType = TypeDesc(
    tag: "Yesenin",
    shortName: "Есенин",
    longName: "Есенин - ИЭИ(И)",
    altName: "Лирик",
    nameDescription: "Интуитивно-этический интроверт (Иррационал)",
    mbti: "INFP",
    moto: "Благородная служба обществу",
    svg: "svgs/yesenin.svg",
    routeName: "/yeseninPage",
    description:
        "Есенины – вечные нытики, считающие себя, сука, жутко гениальными. Попробуйте только не восхититься талантом Еся – это все равно, что не вострепетать перед идеями Дона. Мы, конечно, знаем, что в обоих случаях мы им, придуркам, сильно льстим. Творчество Еся всегда отдает каким-то истеризмом и чернухой, причем поэт должен быть несчастным и голодным, чему Еси наглядное подтверждение. У них вечно нет бабла, потому что за отсутствием мозга как класса они не способны удержать бабки в руках. Их приходится кормить, одевать, обустраивать, после чего они смотрят на вас свысока и разглагольствуют о вашей приземлености и непонимании их высоких нужд. Работать Есенины любят, как ни странно, но представление о «работе» у них необычное – мазня на подрамнике или муть в наушниках преподносится как выстраданное любимое творение, а пошлое отсиживание в офисе с 9 до 6 презирается, потому места официальной работы Есь меняет, как перчатки. Еще Еси пьют, помногу и с трагичным выражением на похмельной роже, и любят всяческие перевоплощения. Когда ваш Есь придет домой с синим хохолком вместо блондинистой гривы и в тулупе на босу ногу, не удивляйтесь – это очередной творческий кризис. А кризис у Еся всегда. Блядки – тоже всегда, причем одновременно он непременно влюблен, и снова неудачно. Объект для страсти Есь выбирает со всей тщательностью – нужна полная гарантия, что это злобное и жестокое существо никогда Еся не полюбит и будет лишь пользоваться его юным и прекрасным телом; тогда Есь вновь будет несчастен, депрессивен, обласкан очередным наивным идиотом, и пойдет творить гениальное направо-налево, пока не будут остановлены метким фингалом Жука, которого вся эта блядская романтика и бардак порядком заебли.",
    strongTypeDesc:
        "Способность мгновенного эмоционального отклика на ситуацию. Люди типа Есенин чутко настроены на атмосферу общения и могут легко ее отрегулировать. Окружающие будут хохотать до упаду или грустить, если Есенин пришел в соответствующее состояние. Не зря его второй псевдоним Лирик, он может точно и четко передать свои эмоции и почувствовать чужие. Он умело использует свое неотразимое обаяние, чтобы погасить чужую агрессию или недоброжелательность. К тому же это довольно отважный тип, несмотря на свою внешнюю виктимность. У него быстрая реакция, хорошее чувство времени и ритма, ощуще-ние стиля. У Есенина выраженный интерес к людям. Работа с клиентами, которых надо склонить на свою сторону, для него как раз подходящая задача. Это своеобразный вызов его способности очаровывать людей, и он с энтузиазмом его принимает.",
    roleTypeDesc:
        "Есенин умеет что-то украсить или оформить к празднику, что-то угадать из грядущих модных тенденций, оценить живопись, дизайн или создать под настроение кулинарный шедевр. Также с хорошим учителем он вполне в состоянии выучить правила дорожного движения, юридические приемы или освоить методы программирования. Конечно, в сложных случаях он включает обаяние, и вокруг находится немало желающих ему помочь. Но на среднем бытовом уровне он вполне способен и готовить и программировать самостоятельно.",
    weakTypeDesc:
        "Сложнее всего людям этого типа оценить имеющиеся ресурсы или изобрести технологические приемы. Есенин с большим трудом контролирует даже собственные финансы, постоянно упуская из виду их утечку. А, например, такое стихийное бедствие, как ремонт квартиры, он вообще предпочитает пережить в стороне. Потому что решать, что делать сначала, что потом, сколько стоит на это потратить, да еще потом отвечать за свои решения - это выглядит в глазах Есенина запутанным и непривлекательным занятием, от которого следует держаться как можно дальше. Кроме того, Есенин программируется на волевое воздействие и может ему уступить. Престиж и высокий статус человека могут привлечь симпатии Есенина сами по себе, и он бессознательно перейдет на его сторону. Или просто подчинится решительному приказу. В подобных ситуациях Есенин теряется, не в силах принять целесообразное решение, поступает как попало.",
    bestPractice:
        "для людей типа Есенин — коммуникации: журналистика, сервис, психология, деятельность, где поддержание эмоционального контакта является главной составляющей успеха. Все помнят улыбку Ю. Гагарина (визитная карточка типа Есенин). Но мало кто задумывался, как невероятно сложно ассимилировать тот вал всепланетной любви, который на него обрушился. Но как раз именно Есенин способен выдержать такое испытание.\n    Все, что связано со стилем, модой, опережением общественных ожиданий, виртуозным владением эмоциями хорошо удается представителям этого типа. Примеры удачной реализации: стилист C. Зверев, модельер Т. Михалкова, артисты Е. Миронов и С. Безруков. Все эти люди, раскрывшие потенциал своего типа, уверенно стоят на ногах и совершенно лишены комплекса маленького беззащитного существа, характерного для индивидов этого типа в случае нереализованности.\n    Мне знакома девушка Есенин, адвокат по профессии. Смешливая блондинка, похожая на Клаудию Шиффер (тот же тип), она вполне уверена в своих силах. Кто же устоит перед столь обаятельным защитником? «Самое главное, склонить человека к сотрудничеству, остальное мелочи», - уверена она.",
    worstPractice:
        "Есенину ответственная работа с финансами или технологией. Особенно если приходится отстаивать свое мнение по этим вопросам.\n    Известен случай, когда женщина Есенин занимала должность бухгалтера небольшой фирмы. Конечно, работа с документами отнимала все ее силы, а уж походы в налоговую инспекцию постоянно сопровождались обращением к директору: «Пойдем со мной, а то я их боюсь!»\n    Знала ямужчину Есенина, руководителя лаборатории в неком институте. Его неуверенность приводила к тотальному контролю сотрудников. Даже сопроводительные письма секретарша не печатала без его визы. Руководство работой аспирантов и подготовка докторской диссертации стоили ему такого стресса, что он очень рано ушел из жизни из-за сердечного приступа.\n    Людям типа Есенин не показаны работы, связанные с финансовой и технологической ответственностью, а также с принятием силовых решений. Эта деятельность требует от них запредельного напряжения и часто приводит к разрушению (даже физическому).",
    forEffectiveWork:
        "такому сотруднику необходимо волевое воздействие и четкое объяснение правил, договоров. Совершенно недопустимо ругать их за неправильное выполнение плохо объясненной работы. ЕсенинУ надо предоставлять тщательно разработанные технологии.",
    extraversion: false,
    logic: false,
    intuition: true,
    rationalization: false,
    relations: <Relation>[
      mirrorRelation,
      businessRelation,
      underControlRelation,
      performerRelation,
      mirrorRelation,
      activationRelation,
      dualRelation,
      equalRelation,
      semiDualRelation,
      familyRelation,
      controlRelation,
      customerRelation,
      conflictRelation,
      quasiRelation,
      oppositeRelation,
      superegoRelation
    ]);

const TypeDesc balzacType = TypeDesc(
    tag: "balzac",
    shortName: "Бальзак",
    longName: "Бальзак - ИЛИ(И)",
    altName: "Критик",
    nameDescription: "Интуитивно-логический интроверт (Иррационал)",
    mbti: "INTP",
    moto: "Любовь к решению проблем",
    svg: "svgs/balzac.svg",
    routeName: "/balzacPage",
    description:
        "Бальзаки – они, сука, пофигисты, ленивые до опупения. Гонят всем, что ищут смысл жизни – вранье: им попросту лень его искать, диван роднее и приятственней. Если Бальзак будет загоняться, что мол, он медленный газ и ниипет – не верьте. Тормоз он, товарищи, редкостный – причем свою тормознутость, сука, свято холит и лелеет, подводя под нее всяческие логические обоснования и умело давя на вашу черную этику. Еще Бальзак умеет прикинуться эмокидом, этаким някой, ибо большие глаза делает, сука, как никто. Однако по сути своей Баль – унылое говно, ни разу не трепетное лань, и ежели вы ждете от него решительного напору, то просидите на жопе до третьего пришествия. Баля следует аккуратно взять за шкирку, оторвать от компьютера и метким пинком подтолкнуть в нужном направлении, не вступая в диспут о смысле сих действий, ибо логика у них, сволочей, развита лучше, чем ожидаешь, на Баля глядючи. Впрочем, в быту они ненапряжны – положите их в уголок с книжкой и конфетами, и те будут себе тихонечко не отсвечивать, пока вы про них не вспомните и не употребите по назначению. К слову, употребить Баля получается у многих, просто потому, что Балю на вас положить. Чем может воспользоваться самый широкий круг лиц, от конфликтера до активатора, а активаторы у Балей еще те – видимо, потому что только их глубокий внутренний похуизм и может активизироваться от такого кошмара во плоти, как Драй.",
    extraversion: false,
    logic: true,
    intuition: true,
    rationalization: false,
    relations: <Relation>[
      oppositeRelation,
      superegoRelation,
      conflictRelation,
      quasiRelation,
      controlRelation,
      customerRelation,
      semiDualRelation,
      familyRelation,
      dualRelation,
      equalRelation,
      mirrorRelation,
      activationRelation,
      underControlRelation,
      performerRelation,
      mirageRelation,
      businessRelation
    ]);

const TypeDesc dostoyevskyType = TypeDesc(
    tag: "Dostoyevsky",
    shortName: "Достоевский",
    longName: "Достоевский - ЭИИ(Р)",
    altName: "Гуманист",
    nameDescription: "Этико-интуитивный интроверт (Рационал)",
    mbti: "INFJ",
    moto: "Вдохновение для других",
    svg: "svgs/dostoyevsky.svg",
    routeName: "/dostoyevskyPage",
    description:
        "Достоевские – они, сука, жалостливые и сердобольные сволочи, которым непременно надо быть в каждой бочке дегтя медовой затычкой. И мед этот, знаете, тягучий такой и липкий, а уж сладкий настолько, что у вас быстро развивается диабет третьей степени. У Достов есть три состояния – они или учат жизни, или умиляются, или плачут. Последнее состояние случается регулярно, ибо огорчает их все подряд, от несовершенства этого мира до неправильного цвета пуговиц на вашем халате, обидеть их куда легче, чем отнять конфету у ребенка, а вот успокоить проблематично, и ныть Дост будет до того момента, пока вы не сделаете всего, что он хотел изначально, а потом еще немножко. Доброта из Достоевского так и прет, и изливается словесным поносом на всех окружающих. Что самое паскудное – в 100 из 100 случаев толку от Достов ноль, но зато они будут так долго капать вам на мозг и сожалеть, что не могут помочь, что вы сами в итоге оторвете жопу от дивана и попретесь по указанному Достом адресу поздравлять ненавистных родственников, кормить бездомных или покупать себе же полезную зелень для диетического супа (который Дост заставит вас приготовить под своим чутким руководством). С виду они походят на святых, посланных в этот жестокий мир, чтоб его спасти, и обожают порассуждать о судьбах мироздания и пороках, захлестнувших современную молодежь. При более внимательном взгляде Достоевский – классические гнилые интеллигенты в очках на сломанной дужке, пользы никакой, но поныть и попризывать к насаждению доброго и вечного огненным мечом – это завсегда, особенно если бороться со злом будет кто-то другой, нередко Драй или Штирля, коего по болевой легко развести на жалость, чем Дост беззастенчиво пользуется.",
    extraversion: false,
    logic: false,
    intuition: true,
    rationalization: true,
    relations: <Relation>[
      underControlRelation,
      performerRelation,
      mirageRelation,
      businessRelation,
      oppositeRelation,
      superegoRelation,
      conflictRelation,
      quasiRelation,
      controlRelation,
      customerRelation,
      semiDualRelation,
      familyRelation,
      dualRelation,
      equalRelation,
      mirrorRelation,
      activationRelation
    ]);

const TypeDesc dreiserType = TypeDesc(
    tag: "Dreiser",
    shortName: "Драйзер",
    longName: "Драйзер - ЭСИ(Р)",
    altName: "Хранитель",
    nameDescription: "Этико-сенсорный интроверт (Рационал)",
    mbti: "ISFJ",
    moto: "Исключительное чувство долга",
    svg: "svgs/dreiser.svg",
    routeName: "/dreiserPage",
    description:
        "Драйзер – это пиздец от соционики, и этим все сказано. Приближаться к ним не рекомендуется никому, будь вы хоть активатором, хоть, не побоимся этого громкого слова, полудуалом — если Драй вас заметил, то мы вам не завидуем. Драйзеры – главные ТИМные скандалисты, довести до истерики могут даже святого (сиречь Доста), и понять, что будет поводом для скандала, невозможно. В качестве доводов Драйзер может привести, как-то: рассказ о том, как вы ужасны были, есть и будете; бритву; веревку с мылом; вопли на весь район. А все почему? Да просто все не так, как хочется этим чистым, голубиным душам, последним инквизиторам этого мира. Искренней бескорыстной ненавистью Драи ненавидят всю эту гребаную жизнь, и хотя они честно учатся, работают, трахаются и рожают детей, в глубине души они знают, что ни к чему хорошему оно все равно не придет, потому что все это НЕПРАВИЛЬНО. К слову, трахаться Драи любят, шо пиздец, и заебут, в прямом и переносном смысле, любого; на внешний вид партнера им по большому счету плевать, но за недокрашенный глаз или криво завязанный галстук вас ждет долгий пиздеж или маленькая разборка. Еще они, суки, ревнивые и эмоциональные, потому орать на вас будут долго, по-любому. Драи, как и Робы, всегда и все знают лучше, чем вы, однако на Робов вы можете наорать или заехать в ебало на крайняк; Драй поддается переубеждению лишь с помощью гаубицы, и то не всегда. Кроме того, они махровые идеалисты и ханжи, набитые принципами и моралью по самое не балуйся, из чего логически вытекает, что главный враг для нормального Драя – это Джек, который любой принцип оценивает исключительно в величинах денежной единицы.",
    extraversion: false,
    logic: false,
    intuition: false,
    rationalization: true,
    relations: <Relation>[
      conflictRelation,
      quasiRelation,
      oppositeRelation,
      superegoRelation,
      mirageRelation,
      businessRelation,
      underControlRelation,
      performerRelation,
      mirrorRelation,
      activationRelation,
      dualRelation,
      equalRelation,
      semiDualRelation,
      familyRelation,
      controlRelation,
      customerRelation
    ]);

const TypeDesc gabinType = TypeDesc(
    tag: "Gabin",
    shortName: "Габен",
    longName: "Габен - СЛИ(И)",
    altName: "Мастер",
    nameDescription: "Сенсорно-логический интроверт (Иррационал)",
    mbti: "ISTP",
    moto: "Готовы попробовать все один раз",
    svg: "svgs/gabin.svg",
    routeName: "/gabinPage",
    description:
        "Габены – они, сука, тихие как мыши, и сидят по жизни в уголку, прикрывшись ветошью. Сидят, починяют примус, конструируют вечный двигатель (вот руки у них не из жопы, что есть, того не отнять), готовят кремовый штрудель или делают еще что-нибудь не менее полезное для мироздания и для вас в частности. Однако не рассчитывайте, что в один прекрасный день Габ вдруг выпрыгнет из угла, расфуфырится и оборотится принцем на белом мерседесе – не выпрыгнет. Ему в своем углу спокойно и хорошо. Людей, особенно ярких Гюг и гиперуверенных Напов, он тихо ненавидит, не осмеливаясь выразить свои чувства вслух; логика подсказывает, что Гекслю, прыгающую вокруг него, как заводной мячик, ненавидит больше всего, но сказать пужается. Габ вообще всегда молчит, и на лице его застыла робкая улыбка, которая безумно раздражает любого, кто способен связать два слова с третьим, в отличие от. Зато Габен хозяйственный, сука, и работящий, гвоздь там забить или паяльником поработать – это ему как два пальца; в постели Габ тоже работящ и активен, как электродрель, и примерно так же блещет фантазией. Добавим, что Габенки женского полу порой косят под «идеального Еся», играя тургеневских трепетных барышень, краснеющих от матерного анекдота, а при близком рассмотрении вместо нежного стыдливого румянца и расцветающего цветка невинности вы обнаруживаете все того же смертельно скучного тихушника, которого все пятьсот позиций из Камасутры не излечат от робкой улыбки, за которую отчетливо хочется двинуть по услужливой роже.",
    extraversion: false,
    logic: true,
    intuition: false,
    rationalization: false,
    relations: <Relation>[
      semiDualRelation,
      familyRelation,
      controlRelation,
      customerRelation,
      conflictRelation,
      quasiRelation,
      oppositeRelation,
      superegoRelation,
      mirageRelation,
      businessRelation,
      underControlRelation,
      performerRelation,
      mirrorRelation,
      activationRelation,
      dualRelation,
      equalRelation
    ]);

const TypeDesc huxleyType = TypeDesc(
    tag: "Huxley",
    shortName: "Гексли",
    longName: "Гексли - ИЭЭ(И)",
    altName: "Советчик",
    nameDescription: "Интуитивно-этический экстраверт (Иррационал)",
    mbti: "ENFP",
    moto: "Получить от жизни все",
    svg: "svgs/huxley.svg",
    routeName: "/huxleyPage",
    description:
        "Гексли – они, сука, веселые. Причем не узнать об этом у вас просто никаких шансов – Гексли веселы всегда, и даже на похоронах это те самые люди, что вспоминают, как покойник в мохнатом 19.. году перелез через забор и порвал штаны в интересном месте. Гекслей всегда много, они как ржа или плесень – даже один Гек производит впечатление заполненности помещения так, что дальше некуда. Геки любят, сука, новизну и приключения – потому их легко развести на поебацца; но влюбляются они предусмотрительно только в унылое говно типа Габена или Дюмки, чувствуют, что только такие рохли их распиздяйство и выдержат. Где Гексли незаменим, так это в компании – никто не уйдет неоприходованным, притом тихо не будет, потому что по каждому вопросу у Гексли непременно имеется свое уникальное и абсолютно парадоксальное мнение. При этом оставлять Гека без присмотра не рекомендуется – он обладает изяществом и грацией бегемота в балетном прикиде, поэтому уберите подальше хрупкие статуэтки и хрупких гостей трагического склада психики, навроде Балей и Гамов. При первом рассмотрении Гексли напоминают маленькое цунами; впоследствии становится ясно, что этот катаклизм закончится, только когда вы выпрете Гексля за дверь, что непросто, ежели у вас еще осталось выпить, а выпить они не дураки. Разглагольствуя о равенстве полов и прочей дребедени, Гексли, вне зависимости от этого самого пола и ориентации, с удовольствием сядут вам на шею, где и останутся навсегда, пребывая в перманентном творческом поиске и запое одновременно. Работать Гексли не любят, а успеха достигают там, где нужно запаривать кому-то мозг и молоть языком без стеснения, и не требуется ничего делать руками; это те самые бродячие продавцы ножей-копилок со встроенным феном и яйцедробилкой, которые оставят вас без копейки денег и еще задружатся на всю жизнь. Но не обманывайтесь их пиздец каким дружелюбием: Гексли известные мудозвоны, а в силу невъебенной уверенности в себе не слушают никого, кроме себя и – якобы – Габенов, которых услышать крайне проблемно.",
    extraversion: true,
    logic: false,
    intuition: true,
    rationalization: false,
    relations: <Relation>[
      familyRelation,
      semiDualRelation,
      customerRelation,
      controlRelation,
      quasiRelation,
      conflictRelation,
      superegoRelation,
      oppositeRelation,
      businessRelation,
      mirageRelation,
      performerRelation,
      underControlRelation,
      activationRelation,
      mirrorRelation,
      equalRelation,
      dualRelation
    ]);

const TypeDesc jackLondonType = TypeDesc(
    tag: "JackLondon",
    shortName: "Джек",
    longName: "Джек - ЛИЭ(Р)",
    altName: "Предприниматель",
    nameDescription: "Логико-интуитивный экстраверт (Рационал)",
    mbti: "ENTJ",
    moto: "Прирожденный лидер",
    svg: "svgs/jackLondon.svg",
    routeName: "/jackLondonPage",
    description:
        "Джеки – они вообще, сука, прохвосты еще те, живчики, для которых на всем белом свете не существует никого, кроме них, любимых. Однако, в отличие от того же Напа, Джек не будет никому пиздеть – он пойдет и сделает, а потом сделает еще раз, и еще, и затрахает вам мозг своей активностью и вечным оптимизмом, от которого хочется стошнить в кулечек. Джек – это тот розовый заяц, который все бежит, сука, и бежит, пока голубые не воспылают нему острой и чистой ненавистью. Он все успевает, у него все работает – нет, не ломается, не горит, как у вас, а именно функционирует; он всегда весел, всегда в нужном месте и в нужное время, всегда готов, как пионер. От его мельтешения у нормального человека рябит в глазах и чешутся кулаки. Материалисты до мозга кости, прагматики от дьявола, уверены в себе донельзя и сияют, как начищенные монетки, в любое время дня и ночи. Если за день в жизни Джека не произошло минимум десяти крайне важных встреч и двух свиданий одновременно, то он чувствует скуку. К слову, эти электровеники из плоти и крови могут производить впечатление примерных семьянинов, но не верьте – где-то между третьим совещанием и корпоративом они уже запланировали грязное приключение с тремя секретаршами. А еще к этим мерзавцам липнут деньги, что крайне раздражает, особливо Донов, которые никак не могут понять, почему столь приземленные придурки зашибают столько бабла, когда такие непризнанные гении, как Доны, опять сидят по уши в дерьме.",
    extraversion: true,
    logic: true,
    intuition: true,
    rationalization: true,
    relations: <Relation>[
      quasiRelation,
      conflictRelation,
      superegoRelation,
      oppositeRelation,
      businessRelation,
      mirageRelation,
      performerRelation,
      underControlRelation,
      activationRelation,
      mirrorRelation,
      equalRelation,
      dualRelation,
      familyRelation,
      semiDualRelation,
      customerRelation,
      controlRelation
    ]);

const TypeDesc napoleonType = TypeDesc(
    tag: "Napoleon",
    shortName: "Наполеон",
    longName: "Наполеон - СЭЭ(И)",
    altName: "Политик",
    nameDescription: "Сенсорно-этический экстраверт (Иррационал)",
    mbti: "ESFP",
    moto: "Жизнь дана нам только раз",
    svg: "svgs/napoleon.svg",
    routeName: "/napoleonPage",
    description:
        "Наполеоны – они, сука, центр вселенной и ниипет. При первом столкновении с Напом вы не замечаете ничего подозрительного – обаятельные гады, они маскируются под Геков или даже Жуков, фееря и сверкая изо всех сил. Через какое-то время вы чувствуете, что вам активно вешают лапшу на уши, и рассказ о том, как Нап ограбил швейцарский банк, переспал с Наоми Кэмпбелл и завоевал мир – все только до завтрака! – теряет для вас свою прелесть. И тут наступает критический момент – вы возражаете Напу, а возможно – если вы самоубийца или Гамлет – даже говорите ему, что он пиздит. Через пару часов, пережив три истерики и сто раз объяснив Напу, что вы верите ему, как себе, и просто оговорились… хочешь чайку?… они идиоты, дада!… вы попытаетесь держаться от него подальше. Но не тут-то было: Нап мертвой хваткой вцепляется в любого, кто не шлет его на хуй при первой встрече, и окружает заботой и вниманием, удушающими, словно паутина Черной вдовы. Поначалу жизнь с Напом кажется сказкой: секс – до утра, обед – из трех блюд, романтические ужины – еженедельно, халатик – только с кружевами; но все сказки имеют обыкновение заканчиваться, а вот Нап – он остается с вами и постепенно выпивает до капли, чтоб сообщить, что вы, собственно, были его недостойны. Кто (или что) может быть достоен Напа – остается тайной, покрытой мраком; и в итоге они находят Баля, который не то чтобы достоен – но ему глубоко наплевать на выпендреж и гонор некоторых излишне шумных уродов.",
    extraversion: true,
    logic: false,
    intuition: false,
    rationalization: false,
    relations: <Relation>[
      superegoRelation,
      oppositeRelation,
      quasiRelation,
      conflictRelation,
      customerRelation,
      controlRelation,
      familyRelation,
      semiDualRelation,
      equalRelation,
      dualRelation,
      activationRelation,
      mirrorRelation,
      performerRelation,
      underControlRelation,
      businessRelation,
      mirageRelation
    ]);

const TypeDesc stierlitzType = TypeDesc(
    tag: "Stierlitz",
    shortName: "Штирлиц",
    longName: "Штирлиц - ЛСЭ(Р)",
    altName: "Администратор",
    nameDescription: "Логико-сенсорный экстраверт (Рационал)",
    mbti: "ESTJ",
    moto: "Хозяева жизни",
    svg: "svgs/stierlitz.svg",
    routeName: "/stierlitzPage",
    description:
        "Штирлицы – они, сука, вообще темные лошадки, чем и бесят. С виду такие добренькие, улыбчивые, помогут завсегда, и не только пиздежом, как Досты, а подойдешь поближе, приглядишься – и кааак наткнешься на дружеский кулак глазом! А еще они такие правильные. Все у них разложено по полочкам, все распланировано на двести лет вперед по десяти разным сценариям, включая: возможный конец света, развод, смену ориентации и прилет на Землю недружественной инопланетной делегации с Сириуса. Разложить по полочкам собственную и чужую жизни для Штирля все равно, что сексом заняться – кстати, трахаться они тоже предпочитают по расписанию, за сюрприз можно и схлопотать. Идеальные исполнители без особых амбиций, работящие пофигисты, на которых, впрочем, начальник всегда поглядывает с некой опаской. В целом, Штирль напоминает сундук с механическим приводом и такой сложной системой замков, что и пробовать не хочется. Еще они непрошибаемо спокойны, как бетонная стена, медленной и уверенной в себе мохнатой гусеницей ползут по жизни в некую лишь им известную сторону, на окружающих обращают внимания не больше, чем на мошек. В отличие от Напа или там Дона не пыжатся, стараясь изобразить из себя нечто – они и так знают, кто они, а мы – нет, потому в близком общении со Штирлем всегда есть некий элемент ужастика, где героиня-блондинка под зловещую музыку распаковывает яркую коробку, в котором вместо конфет оказывается семейка живых тарантулов. Впрочем, там могли быть и шоколадушки, верно? Так и со Штирлицом – проживите с ним хоть всю жизнь, паук может выскочить только в самом конце… или не выскочить. Штирли – они ж, суки, скрытные до жопы, но вообще ниче так ТИМы, из рационалов так вообще лапушки, особливо если сравнить с теми ж Максами.",
    extraversion: true,
    logic: true,
    intuition: false,
    rationalization: true,
    relations: <Relation>[
      performerRelation,
      underControlRelation,
      businessRelation,
      mirageRelation,
      superegoRelation,
      oppositeRelation,
      quasiRelation,
      conflictRelation,
      customerRelation,
      controlRelation,
      familyRelation,
      semiDualRelation,
      equalRelation,
      dualRelation,
      activationRelation,
      mirrorRelation
    ]);

class TypeDesc {
  final String tag;

  final String shortName;
  final String longName;
  final String altName;
  final String nameDescription;
  final String mbti;
  final String moto;
  final String svg;
  final String routeName;
  final String description;
  final String strongTypeDesc;
  final String roleTypeDesc;
  final String weakTypeDesc;
  final String bestPractice;
  final String worstPractice;
  final String forEffectiveWork;
  final bool extraversion;

  final bool logic;
  final bool intuition;
  final bool rationalization;
  final List<Relation> relations;

  const TypeDesc(
      {this.tag,
      this.shortName,
      this.longName,
      this.altName,
      this.nameDescription,
      this.mbti,
      this.moto,
      this.svg,
      this.routeName,
      this.description,
      this.strongTypeDesc,
      this.roleTypeDesc,
      this.weakTypeDesc,
      this.bestPractice,
      this.worstPractice,
      this.forEffectiveWork,
      this.extraversion,
      this.logic,
      this.intuition,
      this.rationalization,
      this.relations})
      : super();

  @override
  String toString() {
    return this.shortName;
  }
}
